## Plan Result (sandbox-enterprise)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8ab6be86-c5cb-4a62-a6cb-ffa01275e938"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e32d2e6a-996f-4a46-a2ee-af158599f412"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b8f2c838-3211-49ed-93ce-a0451d793055"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3fe70e12-a506-450c-9c80-a33bf2bca983"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0c6e5e34-37c7-4ca7-98a1-4b4ada527aa5"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":73,"Program":"tfcmt","SHA1":"","Target":"sandbox-enterprise","Vars":{}} -->